backend/src/tests/load/payroll-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Employee & Payroll Access Flow"
    flow:
      - log: "Login request"
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@example.com"
            password: "password123"
            tenant_slug: "acme-corp"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      - log: "Get employee list"
      - get:
          url: "/api/v1/employees"
          headers:
            Authorization: "Bearer {{ authToken }}"
          
      - log: "Get payroll report"
      - get:
          url: "/api/v1/payroll/reports"
          headers:
            Authorization: "Bearer {{ authToken }}"